using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Investments
{
    //В классе TransactionEntriesGenerator добавьте достаточно транзакций для данной учетной записи, чтобы протестировать ее позже (например, 20 записей за два месяца).
    //+

    /*Завершите класс AccountStatementBuilder:
     *присвойте правильный StartingBalance объекту с именем оператора метода Build() (баланс счета на начало периода, т.е. относительно даты, указанной в переменной from)
     *завершить метод GenerateEntries (в запись также необходимо добавить значения других свойств и рассчитать баланс счета после транзакции — to.Баланс)
    */

    //Завершение класса ConsoleAccountStatementPrinter: вывод записей истории учетной записи на экран в методе PrintEntries.
    /*Завершите класс HtmlAccountStatementPrinter (записывает выписку об учетной записи в HTML-файл):
     * Завершите метод PrinteHeader().
     * Завершите метод PrintEntries().
    */
    //Убедитесь, что класс выводит правильный HTML-код, который открывается и читается в браузере.

    //(HTML-файл создается в подпапке bin/Debug/netXX/ проекта, где XX — версия .NET (5.0, 6.0, vmt).

    //Убедитесь, что баланс счета рассчитан правильно: посчитайте его самостоятельно на бумаге или в Excel и проверьте, что вам выдает программа.

    //Повторите предыдущий шаг с разными временными диапазонами, выберите несколько диапазонов, в которых есть записи в начале или в конце диапазона.

    internal class AATask
{

}
}